In [165]:
import pandas as pd

In [195]:
titanic=pd.read_csv("titanic.csv")

In [167]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [168]:
titanic.drop_duplicates()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [169]:
Gentiles = pd.DataFrame(
    {
        "Name": ["Abraham","Isaac","Jacob","Moses"],
        "Age": [22, 35, 58, None],
        "Sex": ["male", "male", "male","female"],
    }
)

In [170]:
Gentiles.head()

      Name   Age     Sex
0  Abraham  22.0    male
1    Isaac  35.0    male
2    Jacob  58.0    male
3    Moses   NaN  female

In [171]:
Gentiles.dropna()

      Name   Age   Sex
0  Abraham  22.0  male
1    Isaac  35.0  male
2    Jacob  58.0  male

In [172]:
Gentiles.isnull()

    Name    Age    Sex
0  False  False  False
1  False  False  False
2  False  False  False
3  False   True  False

In [173]:
Gentiles.drop_duplicates()

      Name   Age     Sex
0  Abraham  22.0    male
1    Isaac  35.0    male
2    Jacob  58.0    male
3    Moses   NaN  female

In [174]:
Gentiles["Sex"]=Gentiles["Sex"].astype("string")

In [175]:
print(Gentiles.dtypes)

Name            object
Age            float64
Sex     string[python]
dtype: object

In [176]:
print(Gentiles["Sex"].dtype)

string

In [177]:
Gentiles["Age"]=Gentiles["Age"].astype(str)

In [178]:
print(Gentiles.dtypes)

Name            object
Age             object
Sex     string[python]
dtype: object

In [179]:
titanic.sort_values(by="Age").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

In [180]:
titanic["Age"].min()

0.42

In [181]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [182]:
titanic.sort_values(by="Age").tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [183]:
titanic["Age"].max()

80.0

In [184]:
titanic.sort_values(by=["Pclass","Age"],ascending=False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S

In [185]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [199]:
titanic["Age"].min()

1.0

In [188]:
titanic["Age"]=titanic["Age"].apply(lambda x:x*100 if x <1 else x)

In [197]:
titanic.loc[titanic["Age"]<1,"Age"]=titanic["Age"]*100

In [198]:
titanic["Age"].min()

1.0

In [249]:
air_quality_long=pd.read_csv("air_quality_long.csv")

In [251]:
no2 = air_quality_long[air_quality_long["parameter"] == "no2"]

In [252]:
no2_subset = no2.sort_index().groupby(["location"]).head(2)

In [253]:
no2_subset

,city,country,date.utc,location,parameter,value,unit
1825,Paris,FR,2019-06-21 00:00:00+00:00,FR04014,no2,20.0,Âµg/mÂ³
1826,Paris,FR,2019-06-20 23:00:00+00:00,FR04014,no2,21.8,Âµg/mÂ³
3501,Antwerpen,BE,2019-06-17 08:00:00+00:00,BETR801,no2,41.0,Âµg/mÂ³
3502,Antwerpen,BE,2019-06-17 07:00:00+00:00,BETR801,no2,45.0,Âµg/mÂ³
3664,London,GB,2019-06-17 11:00:00+00:00,London Westminster,no2,11.0,Âµg/mÂ³
3665,London,GB,2019-06-17 10:00:00+00:00,London Westminster,no2,11.0,Âµg/mÂ³